In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/pidilite ds intern/train.csv')
df

            ID           STATE  AGE  ... LOYALTY_PROGRAM PAST_PURCHASE  PURCHASE
0            1   Uttar Pradesh   28  ...              No          4937        No
1            2  Madhya Pradesh   27  ...              No         10834        No
2            3     West Bengal   62  ...             NaN          8610       Yes
3            4      Tamil Nadu   27  ...              No         14374       Yes
4            5   Uttar Pradesh   40  ...              No         13158        No
...        ...             ...  ...  ...             ...           ...       ...
149995  149996           Assam   29  ...              No          6241        No
149996  149997  Andhra Pradesh   53  ...              No         29447        No
149997  149998          Odisha   31  ...              No          4856        No
149998  149999  Andhra Pradesh   54  ...             Yes         10031       Yes
149999  150000     Maharashtra   60  ...             NaN          7761       Yes

[150000 rows x 9 columns]

In [ ]:
# Displays the 1st 5 enteries in the dataset
df.head()

   ID           STATE  AGE  ... LOYALTY_PROGRAM PAST_PURCHASE  PURCHASE
0   1   Uttar Pradesh   28  ...              No          4937        No
1   2  Madhya Pradesh   27  ...              No         10834        No
2   3     West Bengal   62  ...             NaN          8610       Yes
3   4      Tamil Nadu   27  ...              No         14374       Yes
4   5   Uttar Pradesh   40  ...              No         13158        No

[5 rows x 9 columns]

In [ ]:
lst  = list(df.columns)
print(lst)

['ID', 'STATE', 'AGE', 'OCCUPATION', 'INCOME_GROUP', 'CUSTOMER_SINCE', 'LOYALTY_PROGRAM', 'PAST_PURCHASE', 'PURCHASE']

In [ ]:
df.dtypes

ID                  int64
STATE              object
AGE                 int64
OCCUPATION         object
INCOME_GROUP       object
CUSTOMER_SINCE      int64
LOYALTY_PROGRAM    object
PAST_PURCHASE       int64
PURCHASE           object
dtype: object

In [ ]:
df.isnull().sum()

ID                     0
STATE                  0
AGE                    0
OCCUPATION             0
INCOME_GROUP           0
CUSTOMER_SINCE         0
LOYALTY_PROGRAM    17824
PAST_PURCHASE          0
PURCHASE               0
dtype: int64

In [ ]:
print(df['ID'].unique())
print(df['STATE'].unique())
print(df['AGE'].unique())
print(df['OCCUPATION'].unique())
print(df['INCOME_GROUP'].unique())
print(df['CUSTOMER_SINCE'].unique())
print(df['LOYALTY_PROGRAM'].unique())
print(df['PAST_PURCHASE'].unique())
print(df['PURCHASE'].unique())

[     1      2      3 ... 149998 149999 150000]
['Uttar Pradesh' 'Madhya Pradesh' 'West Bengal' 'Tamil Nadu' 'Maharashtra'
 'Kerala' 'Goa' 'Karnataka' 'Andhra Pradesh' 'Telangana' 'Chandigarh'
 'Nagaland' 'Andaman and Nicobar Islands' 'Tripura' 'Delhi'
 'Himachal Pradesh' ' ' 'Puducherry' 'Sikkim' 'Gujarat' 'Odisha' 'Bihar'
 'Punjab' 'Arunachal Pradesh' 'Haryana' 'Rajasthan' 'Uttarakhand'
 'Jammu and Kashmir' 'Assam' 'Manipur' 'Mizoram' 'Jharkhand'
 'Chhattisgarh' 'Meghalaya']
[28 27 62 40 68 45 56 67 37 26 31 52 43 32 63 73 46 25 79 44 35 41 55 39
 47 84 42 53 29 57 54 58 50 33 24 34 48 70 36 49 59 38 77 65 60 64 51 69
 61 30 80 74 71 82 75 78 76 66 72 83 81 85 23]
[' ' 'Salaried' 'Self employed' 'Business']
['Low' 'High' 'Medium' ' ']
[2018 2013 2015 2010 2014 2019 2017 2016 2011 2012 2009 2008]
['No' nan 'Yes']
[ 4937 10834  8610 ... 17084 23510 29447]
['No' 'Yes']

# Data Cleaning on Training dataset

In [ ]:
#df = df.drop('ID',axis=1)
#df.head(2)

In [ ]:
df = pd.read_csv('/content/drive/MyDrive/pidilite ds intern/train.csv', na_values= [' '])
df

            ID           STATE  AGE  ... LOYALTY_PROGRAM PAST_PURCHASE  PURCHASE
0            1   Uttar Pradesh   28  ...              No          4937        No
1            2  Madhya Pradesh   27  ...              No         10834        No
2            3     West Bengal   62  ...             NaN          8610       Yes
3            4      Tamil Nadu   27  ...              No         14374       Yes
4            5   Uttar Pradesh   40  ...              No         13158        No
...        ...             ...  ...  ...             ...           ...       ...
149995  149996           Assam   29  ...              No          6241        No
149996  149997  Andhra Pradesh   53  ...              No         29447        No
149997  149998          Odisha   31  ...              No          4856        No
149998  149999  Andhra Pradesh   54  ...             Yes         10031       Yes
149999  150000     Maharashtra   60  ...             NaN          7761       Yes

[150000 rows x 9 columns]

In [ ]:
df.isnull().sum()

ID                     0
STATE               1842
AGE                    0
OCCUPATION         42777
INCOME_GROUP        3437
CUSTOMER_SINCE         0
LOYALTY_PROGRAM    17824
PAST_PURCHASE          0
PURCHASE               0
dtype: int64

In [ ]:
df['STATE'].value_counts()

Maharashtra                    21968
Tamil Nadu                     17836
Uttar Pradesh                  16400
Karnataka                      11689
Gujarat                         7864
West Bengal                     7751
Telangana                       4783
Andhra Pradesh                  4781
Rajasthan                       4621
Kerala                          3718
Madhya Pradesh                  3680
Delhi                           3572
Bihar                           3225
Haryana                         3197
Punjab                          3113
Odisha                          2773
Assam                           2638
Chhattisgarh                    2366
Jharkhand                       2242
Uttarakhand                     1984
Jammu and Kashmir               1962
Himachal Pradesh                1763
Goa                             1735
Tripura                         1735
Chandigarh                      1583
Puducherry                      1503
Meghalaya                       1231
Sikkim                          1200
Nagaland                        1133
Manipur                         1108
Arunachal Pradesh               1065
Mizoram                          984
Andaman and Nicobar Islands      955
Name: STATE, dtype: int64

In [ ]:
df['OCCUPATION'].value_counts()

Self employed    61375
Salaried         44214
Business          1634
Name: OCCUPATION, dtype: int64

In [ ]:
df['INCOME_GROUP'].value_counts()

Low       63523
High      41808
Medium    41232
Name: INCOME_GROUP, dtype: int64

In [ ]:
df['LOYALTY_PROGRAM'].value_counts()

No     88182
Yes    43994
Name: LOYALTY_PROGRAM, dtype: int64

In [ ]:
# Thus its clear that we can't replace missing values of categorical dataset using most recurring values

In [ ]:
df = df.drop('ID',axis=1)
df.head(2)

            STATE  AGE OCCUPATION  ... LOYALTY_PROGRAM  PAST_PURCHASE PURCHASE
0   Uttar Pradesh   28        NaN  ...              No           4937       No
1  Madhya Pradesh   27   Salaried  ...              No          10834       No

[2 rows x 8 columns]

In [ ]:
df.columns

Index(['STATE', 'AGE', 'OCCUPATION', 'INCOME_GROUP', 'CUSTOMER_SINCE',
       'LOYALTY_PROGRAM', 'PAST_PURCHASE', 'PURCHASE'],
      dtype='object')

In [ ]:
print('STATE:',df['STATE'].unique())
print('OCCUPATION',df['OCCUPATION'].unique())
print('INCOME_GROUP:',df['INCOME_GROUP'].unique())
print('LOYALTY_PROGRAM:',df['LOYALTY_PROGRAM'].unique())

STATE: ['Uttar Pradesh' 'Madhya Pradesh' 'West Bengal' 'Tamil Nadu' 'Maharashtra'
 'Kerala' 'Goa' 'Karnataka' 'Andhra Pradesh' 'Telangana' 'Chandigarh'
 'Nagaland' 'Andaman and Nicobar Islands' 'Tripura' 'Delhi'
 'Himachal Pradesh' nan 'Puducherry' 'Sikkim' 'Gujarat' 'Odisha' 'Bihar'
 'Punjab' 'Arunachal Pradesh' 'Haryana' 'Rajasthan' 'Uttarakhand'
 'Jammu and Kashmir' 'Assam' 'Manipur' 'Mizoram' 'Jharkhand'
 'Chhattisgarh' 'Meghalaya']
OCCUPATION [nan 'Salaried' 'Self employed' 'Business']
INCOME_GROUP: ['Low' 'High' 'Medium' nan]
LOYALTY_PROGRAM: ['No' nan 'Yes']

In [ ]:
df.isnull().sum()

STATE               1842
AGE                    0
OCCUPATION         42777
INCOME_GROUP        3437
CUSTOMER_SINCE         0
LOYALTY_PROGRAM    17824
PAST_PURCHASE          0
PURCHASE               0
dtype: int64

In [ ]:
missing_data_train = ['STATE','OCCUPATION', 'INCOME_GROUP', 'LOYALTY_PROGRAM']

In [ ]:
df.isnull().sum()

STATE               1842
AGE                    0
OCCUPATION         42777
INCOME_GROUP        3437
CUSTOMER_SINCE         0
LOYALTY_PROGRAM    17824
PAST_PURCHASE          0
PURCHASE               0
dtype: int64

In [ ]:
print('OCCUPATION',df['OCCUPATION'].unique())
print('LOYALTY_PROGRAM:',df['LOYALTY_PROGRAM'].unique())

OCCUPATION [nan 'Salaried' 'Self employed' 'Business']
LOYALTY_PROGRAM: ['No' nan 'Yes']

In [ ]:
df['OCCUPATION'] = df['OCCUPATION'].map({'Salaried':0,'Self employed':1, 'Business':2})
print('OCCUPATION',df['OCCUPATION'].unique())

OCCUPATION [nan  0.  1.  2.]

In [ ]:
df['LOYALTY_PROGRAM'] = df['LOYALTY_PROGRAM'].map({'No':0,'Yes':1})
print('LOYALTY_PROGRAM:',df['LOYALTY_PROGRAM'].unique())

LOYALTY_PROGRAM: [ 0. nan  1.]

In [ ]:
df['PURCHASE'] = df['PURCHASE'].map({'No':0,'Yes':1})

In [ ]:
print('STATE:',df['STATE'].unique())

STATE: ['Uttar Pradesh' 'Madhya Pradesh' 'West Bengal' 'Tamil Nadu' 'Maharashtra'
 'Kerala' 'Goa' 'Karnataka' 'Andhra Pradesh' 'Telangana' 'Chandigarh'
 'Nagaland' 'Andaman and Nicobar Islands' 'Tripura' 'Delhi'
 'Himachal Pradesh' nan 'Puducherry' 'Sikkim' 'Gujarat' 'Odisha' 'Bihar'
 'Punjab' 'Arunachal Pradesh' 'Haryana' 'Rajasthan' 'Uttarakhand'
 'Jammu and Kashmir' 'Assam' 'Manipur' 'Mizoram' 'Jharkhand'
 'Chhattisgarh' 'Meghalaya']

In [ ]:
df['STATE'] = df['STATE'].map({'Uttar Pradesh':0, 'Madhya Pradesh':1, 'West Bengal':2, 'Tamil Nadu':3, 'Maharashtra':4,
 'Kerala':5, 'Goa':6, 'Karnataka':7, 'Andhra Pradesh':8, 'Chandigarh':9, 'Nagaland':10,
 'Andaman and Nicobar Islands':11, 'Tripura':12, 'Delhi':13, 'Himachal Pradesh':14,
 'Puducherry':15, 'Sikkim':16, 'Gujarat':17, 'Odisha':18, 'Bihar':19, 'Telangana':20, 'Punjab':21,
 'Arunachal Pradesh':22, 'Haryana':23, 'Rajasthan':24, 'Uttarakhand':25,
 'Jammu and Kashmir':26, 'Assam':27, 'Manipur':28, 'Mizoram':29, 'Jharkhand':30,
 'Chhattisgarh':31, 'Meghalaya':32})
print('STATE:',df['STATE'].unique())

STATE: [ 0.  1.  2.  3.  4.  5.  6.  7.  8. 20.  9. 10. 11. 12. 13. 14. nan 15.
 16. 17. 18. 19. 21. 22. 23. 24. 25. 26. 27. 28. 29. 30. 31. 32.]

In [ ]:
print('INCOME_GROUP:',df['INCOME_GROUP'].unique())

INCOME_GROUP: ['Low' 'High' 'Medium' nan]

In [ ]:
df['INCOME_GROUP'] = df['INCOME_GROUP'].map({'Low':0,'High':1, 'Medium':2})
print('INCOME_GROUP:',df['INCOME_GROUP'].unique())

INCOME_GROUP: [ 0.  1.  2. nan]

In [ ]:
df.head(15)

    STATE  AGE  OCCUPATION  ...  LOYALTY_PROGRAM  PAST_PURCHASE  PURCHASE
0     0.0   28         NaN  ...              0.0           4937         0
1     1.0   27         0.0  ...              0.0          10834         0
2     2.0   62         NaN  ...              NaN           8610         1
3     3.0   27         0.0  ...              0.0          14374         1
4     0.0   40         1.0  ...              0.0          13158         0
5     4.0   28         0.0  ...              0.0           5159         0
6     3.0   68         NaN  ...              NaN          12780         1
7     4.0   45         1.0  ...              0.0           5018         0
8     2.0   56         1.0  ...              1.0           7238         0
9     3.0   67         NaN  ...              1.0          25120         1
10    0.0   37         1.0  ...              1.0           6602         0
11    3.0   26         0.0  ...              1.0           7529         1
12    5.0   31         NaN  ...              0.0           3853         0
13    6.0   37         0.0  ...              0.0           7477         0
14    7.0   52         1.0  ...              0.0           8604         0

[15 rows x 8 columns]

In [ ]:
df.isnull().sum()

STATE               1842
AGE                    0
OCCUPATION         42777
INCOME_GROUP        3437
CUSTOMER_SINCE         0
LOYALTY_PROGRAM    17824
PAST_PURCHASE          0
PURCHASE               0
dtype: int64

In [ ]:
df1 = df.copy()

In [ ]:
df1[missing_data_train].isnull().sum()

STATE               1842
OCCUPATION         42777
INCOME_GROUP        3437
LOYALTY_PROGRAM    17824
dtype: int64

In [ ]:
from sklearn.impute import KNNImputer
knn_imp = KNNImputer(n_neighbors=5)

In [ ]:
df1[missing_data_train] = knn_imp.fit_transform(df1[missing_data_train])

In [ ]:
df1[missing_data_train].isnull().sum()

STATE              0
OCCUPATION         0
INCOME_GROUP       0
LOYALTY_PROGRAM    0
dtype: int64

In [ ]:
df = df1.copy()
df.head(15)

    STATE  AGE  OCCUPATION  ...  LOYALTY_PROGRAM  PAST_PURCHASE  PURCHASE
0     0.0   28         0.2  ...              0.0           4937         0
1     1.0   27         0.0  ...              0.0          10834         0
2     2.0   62         1.0  ...              0.2           8610         1
3     3.0   27         0.0  ...              0.0          14374         1
4     0.0   40         1.0  ...              0.0          13158         0
5     4.0   28         0.0  ...              0.0           5159         0
6     3.0   68         0.8  ...              0.4          12780         1
7     4.0   45         1.0  ...              0.0           5018         0
8     2.0   56         1.0  ...              1.0           7238         0
9     3.0   67         1.0  ...              1.0          25120         1
10    0.0   37         1.0  ...              1.0           6602         0
11    3.0   26         0.0  ...              1.0           7529         1
12    5.0   31         0.4  ...              0.0           3853         0
13    6.0   37         0.0  ...              0.0           7477         0
14    7.0   52         1.0  ...              0.0           8604         0

[15 rows x 8 columns]

# Building ML models

In [ ]:
# Storing dependent variable in X.
X = df.drop('PURCHASE',axis=1)
X.head()

   STATE  AGE  OCCUPATION  ...  CUSTOMER_SINCE  LOYALTY_PROGRAM  PAST_PURCHASE
0    0.0   28         0.2  ...            2018              0.0           4937
1    1.0   27         0.0  ...            2018              0.0          10834
2    2.0   62         1.0  ...            2013              0.2           8610
3    3.0   27         0.0  ...            2018              0.0          14374
4    0.0   40         1.0  ...            2015              0.0          13158

[5 rows x 7 columns]

In [ ]:
# Storing dependent variable in y.
y = df['PURCHASE']
y.head()

0    0
1    0
2    1
3    1
4    0
Name: PURCHASE, dtype: int64

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3)

In [ ]:
# Scaling the data such that it is centered around 0 (due to large difference in range in dataset).
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
X_train = ss.fit_transform(X_train)
X_test = ss.transform(X_test)

## Logistic Regression

In [ ]:
from sklearn.linear_model import LogisticRegression
# Creating logistic regression object to train the model.
lr = LogisticRegression()
# Training the dataset.
lr.fit(X_train, y_train)
# Predicting the value based on trained model.
y_pred_lr = lr.predict(X_test)
from sklearn.metrics import accuracy_score
accuracy_lr = accuracy_score(y_test, y_pred_lr)
print('Logistic regression has accuracy of:',accuracy_lr)

Logistic regression has accuracy of: 0.7601777777777777

## Random Forest Classifier

In [ ]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier()
# Studying the dataset and training the ML model.
rfc.fit(X_train, y_train)
# Predicting the outcome based on the trained model.
y_pred_rfc = rfc.predict(X_test)
from sklearn.metrics import accuracy_score
accuracy_rfc = accuracy_score(y_test, y_pred_rfc)
print('Random Forest Classifier has accuracy of:',accuracy_rfc)

Random Forest Classifier has accuracy of: 0.8351555555555555

## Decision Tree Classifier

In [ ]:
from sklearn.tree import DecisionTreeClassifier
dtc = DecisionTreeClassifier()
# Studying the dataset and training the ML model.
dtc.fit(X_train, y_train)
# Predicting the outcome based on the trained model.
y_pred_dtc = dtc.predict(X_test)
accuracy_dtc = accuracy_score(y_test, y_pred_dtc)
print('Decision Tree Classifier has accuracy of:',accuracy_dtc)

Decision Tree Classifier has accuracy of: 0.7794

# As Random forest Classifier has the highest accuracy of around 83 %. Thus we'll use it to built to train and built the the ML Model.

## Performing data cleaning on the Test Data.

In [ ]:
df_test = pd.read_csv('/content/drive/MyDrive/pidilite ds intern/test.csv')

In [ ]:
df_test.head(15)

        ID                        STATE  ...  LOYALTY_PROGRAM PAST_PURCHASE
0   150001                  Maharashtra  ...               No         12746
1   150002                  Maharashtra  ...              Yes         12277
2   150003  Andaman and Nicobar Islands  ...              Yes         16401
3   150004                      Mizoram  ...              Yes          9665
4   150005                Uttar Pradesh  ...               No         15724
5   150006                  Maharashtra  ...              NaN         58967
6   150007                  Maharashtra  ...               No         14527
7   150008                  Maharashtra  ...              Yes         16032
8   150009                   Puducherry  ...               No          4465
9   150010                  Maharashtra  ...               No         14203
10  150011                   Tamil Nadu  ...              Yes          5332
11  150012                      Gujarat  ...               No          3431
12  150013                   Tamil Nadu  ...              Yes          6677
13  150014                    Karnataka  ...              Yes          6211
14  150015                   Tamil Nadu  ...              Yes         17518

[15 rows x 8 columns]

In [ ]:
df_test = pd.read_csv('/content/drive/MyDrive/pidilite ds intern/test.csv', na_values= [' '])
df_test.head(15)

        ID                        STATE  ...  LOYALTY_PROGRAM PAST_PURCHASE
0   150001                  Maharashtra  ...               No         12746
1   150002                  Maharashtra  ...              Yes         12277
2   150003  Andaman and Nicobar Islands  ...              Yes         16401
3   150004                      Mizoram  ...              Yes          9665
4   150005                Uttar Pradesh  ...               No         15724
5   150006                  Maharashtra  ...              NaN         58967
6   150007                  Maharashtra  ...               No         14527
7   150008                  Maharashtra  ...              Yes         16032
8   150009                   Puducherry  ...               No          4465
9   150010                  Maharashtra  ...               No         14203
10  150011                   Tamil Nadu  ...              Yes          5332
11  150012                      Gujarat  ...               No          3431
12  150013                   Tamil Nadu  ...              Yes          6677
13  150014                    Karnataka  ...              Yes          6211
14  150015                   Tamil Nadu  ...              Yes         17518

[15 rows x 8 columns]

In [ ]:
df_test.isnull().sum()

ID                     0
STATE                576
AGE                    0
OCCUPATION         14380
INCOME_GROUP        1118
CUSTOMER_SINCE         0
LOYALTY_PROGRAM     6004
PAST_PURCHASE          0
dtype: int64

In [ ]:
df_test.columns

Index(['ID', 'STATE', 'AGE', 'OCCUPATION', 'INCOME_GROUP', 'CUSTOMER_SINCE',
       'LOYALTY_PROGRAM', 'PAST_PURCHASE'],
      dtype='object')

In [ ]:
missing_data_test = ['STATE','OCCUPATION', 'INCOME_GROUP', 'LOYALTY_PROGRAM']

In [ ]:
id_series = df_test['ID']
df_test = df_test.drop('ID',axis=1)
df_test.head(2)

         STATE  AGE  ... LOYALTY_PROGRAM PAST_PURCHASE
0  Maharashtra   50  ...              No         12746
1  Maharashtra   58  ...             Yes         12277

[2 rows x 7 columns]

In [ ]:
print('STATE:',df_test['STATE'].unique())

STATE: ['Maharashtra' 'Andaman and Nicobar Islands' 'Mizoram' 'Uttar Pradesh'
 'Puducherry' 'Tamil Nadu' 'Gujarat' 'Karnataka' 'Kerala'
 'Himachal Pradesh' 'Punjab' 'Rajasthan' 'West Bengal' 'Uttarakhand' nan
 'Telangana' 'Chandigarh' 'Meghalaya' 'Andhra Pradesh' 'Chhattisgarh'
 'Delhi' 'Assam' 'Goa' 'Odisha' 'Jammu and Kashmir' 'Haryana' 'Bihar'
 'Jharkhand' 'Madhya Pradesh' 'Nagaland' 'Arunachal Pradesh' 'Tripura'
 'Sikkim' 'Manipur']

In [ ]:
print('OCCUPATION',df_test['OCCUPATION'].unique())

OCCUPATION ['Self employed' 'Salaried' nan 'Business']

In [ ]:
print('INCOME_GROUP:',df_test['INCOME_GROUP'].unique())

INCOME_GROUP: ['Medium' 'High' 'Low' nan]

In [ ]:
print('LOYALTY_PROGRAM:',df_test['LOYALTY_PROGRAM'].unique())

LOYALTY_PROGRAM: ['No' 'Yes' nan]

In [ ]:
df_test['OCCUPATION'] = df_test['OCCUPATION'].map({'Salaried':0,'Self employed':1, 'Business':2})
print('OCCUPATION',df_test['OCCUPATION'].unique())

OCCUPATION [ 1.  0. nan  2.]

In [ ]:
df_test['LOYALTY_PROGRAM'] = df_test['LOYALTY_PROGRAM'].map({'No':0,'Yes':1})
print('LOYALTY_PROGRAM:',df_test['LOYALTY_PROGRAM'].unique())

LOYALTY_PROGRAM: [ 0.  1. nan]

In [ ]:
df_test['STATE'] = df_test['STATE'].map({'Uttar Pradesh':0, 'Madhya Pradesh':1, 'West Bengal':2, 'Tamil Nadu':3, 'Maharashtra':4,
 'Kerala':5, 'Goa':6, 'Karnataka':7, 'Andhra Pradesh':8, 'Chandigarh':9, 'Nagaland':10,
 'Andaman and Nicobar Islands':11, 'Tripura':12, 'Delhi':13, 'Himachal Pradesh':14,
 'Puducherry':15, 'Sikkim':16, 'Gujarat':17, 'Odisha':18, 'Bihar':19, 'Telangana':20, 'Punjab':21,
 'Arunachal Pradesh':22, 'Haryana':23, 'Rajasthan':24, 'Uttarakhand':25,
 'Jammu and Kashmir':26, 'Assam':27, 'Manipur':28, 'Mizoram':29, 'Jharkhand':30,
 'Chhattisgarh':31, 'Meghalaya':32})
print('STATE:',df_test['STATE'].unique())

STATE: [ 4. 11. 29.  0. 15.  3. 17.  7.  5. 14. 21. 24.  2. 25. nan 20.  9. 32.
  8. 31. 13. 27.  6. 18. 26. 23. 19. 30.  1. 10. 22. 12. 16. 28.]

In [ ]:
df_test['INCOME_GROUP'] = df_test['INCOME_GROUP'].map({'Low':0,'High':1, 'Medium':2})
print('INCOME_GROUP:',df_test['INCOME_GROUP'].unique())

INCOME_GROUP: [ 2.  1.  0. nan]

In [ ]:
df_test.head(20)

    STATE  AGE  OCCUPATION  ...  CUSTOMER_SINCE  LOYALTY_PROGRAM  PAST_PURCHASE
0     4.0   50         1.0  ...            2018              0.0          12746
1     4.0   58         1.0  ...            2011              1.0          12277
2    11.0   30         0.0  ...            2017              1.0          16401
3    29.0   27         0.0  ...            2018              1.0           9665
4     0.0   67         NaN  ...            2014              0.0          15724
5     4.0   57         1.0  ...            2010              NaN          58967
6     4.0   50         1.0  ...            2013              0.0          14527
7     4.0   45         1.0  ...            2013              1.0          16032
8    15.0   26         0.0  ...            2018              0.0           4465
9     4.0   72         NaN  ...            2014              0.0          14203
10    3.0   63         NaN  ...            2012              1.0           5332
11   17.0   41         1.0  ...            2017              0.0           3431
12    3.0   51         1.0  ...            2017              1.0           6677
13    7.0   72         NaN  ...            2016              1.0           6211
14    3.0   63         NaN  ...            2017              1.0          17518
15    3.0   33         NaN  ...            2017              0.0           6326
16    0.0   52         1.0  ...            2017              0.0          12981
17    4.0   48         1.0  ...            2013              1.0           3945
18    7.0   37         1.0  ...            2017              0.0           5736
19    5.0   49         1.0  ...            2017              0.0          11107

[20 rows x 7 columns]

In [ ]:
df_test[missing_data_test].isnull().sum()

STATE                576
OCCUPATION         14380
INCOME_GROUP        1118
LOYALTY_PROGRAM     6004
dtype: int64

In [ ]:
df2 = df_test.copy()

In [ ]:
from sklearn.impute import KNNImputer
knn_imp2 = KNNImputer(n_neighbors=5)

In [ ]:
df2[missing_data_test] = knn_imp2.fit_transform(df2[missing_data_test])

In [ ]:
df2[missing_data_test].isnull().sum()

STATE              0
OCCUPATION         0
INCOME_GROUP       0
LOYALTY_PROGRAM    0
dtype: int64

In [ ]:
df_test = df2.copy()
df_test.head(15)

    STATE  AGE  OCCUPATION  ...  CUSTOMER_SINCE  LOYALTY_PROGRAM  PAST_PURCHASE
0     4.0   50         1.0  ...            2018              0.0          12746
1     4.0   58         1.0  ...            2011              1.0          12277
2    11.0   30         0.0  ...            2017              1.0          16401
3    29.0   27         0.0  ...            2018              1.0           9665
4     0.0   67         1.0  ...            2014              0.0          15724
5     4.0   57         1.0  ...            2010              0.8          58967
6     4.0   50         1.0  ...            2013              0.0          14527
7     4.0   45         1.0  ...            2013              1.0          16032
8    15.0   26         0.0  ...            2018              0.0           4465
9     4.0   72         0.6  ...            2014              0.0          14203
10    3.0   63         0.4  ...            2012              1.0           5332
11   17.0   41         1.0  ...            2017              0.0           3431
12    3.0   51         1.0  ...            2017              1.0           6677
13    7.0   72         0.8  ...            2016              1.0           6211
14    3.0   63         0.2  ...            2017              1.0          17518

[15 rows x 7 columns]

# Building the Random Classifier Model to get the requierd data.

In [ ]:
# Storing dependent variable in X.
X_train_data = df.drop('PURCHASE',axis=1)
X_train_data.head()

   STATE  AGE  OCCUPATION  ...  CUSTOMER_SINCE  LOYALTY_PROGRAM  PAST_PURCHASE
0    0.0   28         0.2  ...            2018              0.0           4937
1    1.0   27         0.0  ...            2018              0.0          10834
2    2.0   62         1.0  ...            2013              0.2           8610
3    3.0   27         0.0  ...            2018              0.0          14374
4    0.0   40         1.0  ...            2015              0.0          13158

[5 rows x 7 columns]

In [ ]:
# Storing dependent variable in y.
y_train_data = df['PURCHASE']
y_train_data.head()

0    0
1    0
2    1
3    1
4    0
Name: PURCHASE, dtype: int64

In [ ]:
# Scaling the data such that it is centered around 0 (due to large difference in range in dataset).
from sklearn.preprocessing import StandardScaler
ss = StandardScaler()
X_train_data = ss.fit_transform(X_train_data)
df_test = ss.transform(df_test)

In [ ]:
from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier()
# Studying the dataset and training the ML model.
rfc.fit(X_train_data, y_train_data)
# Predicting the outcome based on the trained model.
y_pred_test = rfc.predict(df_test)

In [ ]:
y_pred_test

array([0, 1, 0, ..., 0, 0, 0])

In [ ]:
id_series

0        150001
1        150002
2        150003
3        150004
4        150005
          ...
49995    199996
49996    199997
49997    199998
49998    199999
49999    200000
Name: ID, Length: 50000, dtype: int64

In [ ]:
len(y_pred_test)

50000

In [ ]:
type(y_pred_test)

numpy.ndarray

In [ ]:
type(id_series)

pandas.core.series.Series

In [ ]:
pd_series = pd.Series(y_pred_test)

In [ ]:
df3 = pd.concat([id_series, pd_series], axis=1)
df3

           ID  0
0      150001  0
1      150002  1
2      150003  0
3      150004  0
4      150005  0
...       ... ..
49995  199996  0
49996  199997  1
49997  199998  0
49998  199999  0
49999  200000  0

[50000 rows x 2 columns]

In [ ]:
df3.columns = ['ID', 'PURCHASE']

In [ ]:
df3['PURCHASE'] = df3['PURCHASE'].map({0:'No',1:'Yes'})

In [ ]:
df3.to_csv('final.csv')
!cp final.csv "drive/My Drive/"

In [ ]:
df3['PURCHASE'].value_counts()

No     40328
Yes     9672
Name: PURCHASE, dtype: int64